<!-- dflook/terraform-github-actions {"workspace":"default","backend":"091e6331e906396c8ae9346a84e0ad150e4acc6911567dd7a62274e751b5d8ae","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #248 at https://github.com/dflook/terraform-github-actions/actions/runs/3235515059","plan_hash":"98a9d691d268f31c5ca8e9912185dcde0ab61e888dbea42d8f0180f24e3c6f80","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "aHXhTz4IpF" -> (known after apply)
  ~ foreach = "kcPmbtXwPJ" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #248](https://github.com/dflook/terraform-github-actions/actions/runs/3235515059)